Merge pull request #49 from manojksarkar/fix/flowchart-issue
Fix/flowchart issue
